In [2]:
import pandas as pd

In [2]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [3]:
type(items)

dict

In [4]:
shopping_carts = pd.DataFrame(items)

In [6]:
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [8]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [10]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [12]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [13]:
shopping_carts.shape

(5, 2)

In [14]:
shopping_carts.size

10

In [15]:
shopping_carts.ndim

2

In [17]:
bob_shopping_cart = pd.DataFrame(items, columns = ['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [18]:
sel_shopping_cart = pd.DataFrame(items, index = ['book', 'bike'])
sel_shopping_cart

        Bob  Alice
book    NaN     40
bike  245.0    500

In [21]:
alice_sel_shopping_cart = pd.DataFrame(items, index = ['book', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

      Alice
book     40
bike    500

In [22]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

In [24]:
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [25]:
df = pd.DataFrame(data, index = ['index1', 'index2', 'index3'])
df

        Integers  Floats
index1         1     4.5
index2         2     8.2
index3         3     9.6

## DataFrame的数据结构分析
1）字典的key值作为DataFrame的列标签

2）字典的value值作为DataFrame的数据内容

3）当字典的value值为单个数据时，必须指定DataFrame的index，即行标签

4）当字典的value值为列表或元组时，可以不指定index，DataFrame用默认index

In [29]:
data = {'Integers' : 1,
        'Floats' : 3.4}
df1 = pd.DataFrame(data, index = ['index1'])
df1

        Integers  Floats
index1         1     3.4

In [8]:
data = {'Integers' : (1, 2),
        'Floats' : (3.4, 1.3)}
print(data)
df1 = pd.DataFrame(data, index = ('index1', 'index2'))
df1

{'Integers': (1, 2), 'Floats': (3.4, 1.3)}

        Integers  Floats
index1         1     3.4
index2         2     1.3

In [9]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [10]:
store_items = pd.DataFrame(items2)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [20]:
#访问列元素，列标签以列表的形式提供
store_items[['bikes','pants']]

        bikes  pants
store1     20     30
store2     15      5

In [16]:
store_items.index = ['store1', 'store2']
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [21]:
#访问行元素
store_items.loc[['store1']]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [23]:
#访问单个元素，先提供列标签，再提供行标签，格式为dataframe[column][row]。如果先提供行标签再提供列标签会报错。
store_items['bikes']['store1']

20

In [27]:
#给DataFrame添加列
store_items['shirts'] = [10, 3]
store_items

        bikes  glasses  pants  watches  shirts
store1     20      NaN     30       35      10
store2     15     50.0      5       10       3

In [28]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

        bikes  glasses  pants  watches  shirts  suits
store1     20      NaN     30       35      10     40
store2     15     50.0      5       10       3      8

In [32]:
#给DataFrame添加新行，需要先创建一个新的DataFrame，然后append到原DataFrame末尾
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store3'])
new_store

        bikes  glasses  pants  watches
store3     20        4     30       35

In [37]:
store_items = store_items.append(new_store, sort=False)
store_items

         bikes  glasses  pants  shirts  suits  watches
store1      20      NaN     30    10.0   40.0       35
store2      15     50.0      5     3.0    8.0       10
store 3     20      4.0     30     NaN    NaN       35
store3      20      4.0     30     NaN    NaN       35
store3      20      4.0     30     NaN    NaN       35

In [41]:
store_items = store_items.drop(['store3'], axis = 0)
store_items

         bikes  glasses  pants  shirts  suits  watches
store1      20      NaN     30    10.0   40.0       35
store2      15     50.0      5     3.0    8.0       10
store 3     20      4.0     30     NaN    NaN       35

In [45]:
store_items.index = ['store1', 'store2', 'store3']
store_items

        bikes  glasses  pants  shirts  suits  watches
store1     20      NaN     30    10.0   40.0       35
store2     15     50.0      5     3.0    8.0       10
store3     20      4.0     30     NaN    NaN       35

In [62]:
store_items.loc[('store1', 'store2'),'watches']

store1    35
store2    10
Name: watches, dtype: int64

In [65]:
store_items['new watches'] = store_items['watches'][1:]
store_items

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

        bikes  glasses  pants  shirts  suits  watches  new watches
store1     20      NaN     30    10.0   40.0       35          NaN
store2     15     50.0      5     3.0    8.0       10         10.0
store3     20      4.0     30     NaN    NaN       35         35.0

In [68]:
#插入一列数据dataframe.insert(loc,label,data)
store_items.insert(4, 'shoe', [12, 3, 4])
store_items

,bikes,glasses,pants,shirts,shoe,shoes,suits,watches,new watches
store1,20,NaN,30,10.0,12,12,40.0,35,NaN
store2,15,50.0,5,3.0,3,3,8.0,10,10.0
store3,20,4.0,30,NaN,4,4,NaN,35,35.0

In [69]:
store_items.pop('shoe')
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store1     20      NaN     30    10.0     12   40.0       35          NaN
store2     15     50.0      5     3.0      3    8.0       10         10.0
store3     20      4.0     30     NaN      4    NaN       35         35.0

In [71]:
store_items = store_items.rename(columns = {'bikes':'hats'})
store_items

        hats  glasses  pants  shirts  shoes  suits  watches  new watches
store1    20      NaN     30    10.0     12   40.0       35          NaN
store2    15     50.0      5     3.0      3    8.0       10         10.0
store3    20      4.0     30     NaN      4    NaN       35         35.0

In [72]:
store_items = store_items.rename(index = {'store1':'store4'})
store_items

        hats  glasses  pants  shirts  shoes  suits  watches  new watches
store4    20      NaN     30    10.0     12   40.0       35          NaN
store2    15     50.0      5     3.0      3    8.0       10         10.0
store3    20      4.0     30     NaN      4    NaN       35         35.0

In [73]:
store_items = store_items.rename(columns = {'hats':'bikes', 'glasses':'pens'})
store_items

        bikes  pens  pants  shirts  shoes  suits  watches  new watches
store4     20   NaN     30    10.0     12   40.0       35          NaN
store2     15  50.0      5     3.0      3    8.0       10         10.0
store3     20   4.0     30     NaN      4    NaN       35         35.0

In [74]:
store_items = store_items.set_index('pants')
store_items

       bikes  pens  shirts  shoes  suits  watches  new watches
pants
30        20   NaN    10.0     12   40.0       35          NaN
5         15  50.0     3.0      3    8.0       10         10.0
30        20   4.0     NaN      4    NaN       35         35.0

In [75]:
store_items = store_items.set_index('pens')
store_items

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN       20    10.0     12   40.0       35          NaN
 50.0     15     3.0      3    8.0       10         10.0
 4.0      20     NaN      4    NaN       35         35.0

## 处理NaN数据

In [77]:
x = store_items.isnull()
print(x)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN    False   False  False  False    False         True
 50.0  False   False  False  False    False        False
 4.0   False    True  False   True    False        False

In [78]:
x.sum()

bikes          0
shirts         1
shoes          0
suits          1
watches        0
new watches    1
dtype: int64

In [80]:
x.sum().sum()

3

In [81]:
store_items.count()

bikes          3
shirts         2
shoes          3
suits          2
watches        3
new watches    2
dtype: int64

In [89]:
#删除有NaN值的行，注意，.dropna() 方法不在原地地删除具有 NaN 值的行或列。
#也就是说，原始 DataFrame 不会改变。你始终可以在 dropna() 方法中将关键字 inplace 设为 True，在原地删除目标行或列。
store_items.dropna(axis = 0)

      bikes  shirts  shoes  suits  watches  new watches
pens
50.0     15     3.0      3    8.0       10         10.0

In [83]:
#删除有NaN值的列
store_items.dropna(axis = 1)

       bikes  shoes  watches
pens
NaN       20     12       35
 50.0     15      3       10
 4.0      20      4       35

In [86]:
#用0替换NaN值
store_items.fillna(0)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN       20    10.0     12   40.0       35          0.0
 50.0     15     3.0      3    8.0       10         10.0
 4.0      20     0.0      4    0.0       35         35.0

In [87]:
#用上一行数据替换NaN值，填充的方法还有向后填充method='backfill'
store_items.fillna(method = 'ffill', axis = 0)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN       20    10.0     12   40.0       35          NaN
 50.0     15     3.0      3    8.0       10         10.0
 4.0      20     3.0      4    8.0       35         35.0

In [88]:
#用前面1列数据替换NaN值
store_items.fillna(method = 'ffill', axis = 1)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN     20.0    10.0   12.0   40.0     35.0         35.0
 50.0   15.0     3.0    3.0    8.0     10.0         10.0
 4.0    20.0    20.0    4.0    4.0     35.0         35.0

In [90]:
#还可以选择使用不同的插值方法替换 NaN 值。
#例如，.interpolate(method = 'linear', axis) 方法将通过 linear 插值使用沿着给定 axis 的值替换 NaN 值。
store_items.interpolate(method = 'linear', axis = 1)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN     20.0    10.0   12.0   40.0     35.0         35.0
 50.0   15.0     3.0    3.0    8.0     10.0         10.0
 4.0    20.0    12.0    4.0   19.5     35.0         35.0

In [91]:
store_items.interpolate(method = 'linear', axis = 0)

       bikes  shirts  shoes  suits  watches  new watches
pens
NaN       20    10.0     12   40.0       35          NaN
 50.0     15     3.0      3    8.0       10         10.0
 4.0      20     3.0      4    8.0       35         35.0

In [92]:
store_items.mean()

bikes          18.333333
shirts          6.500000
shoes           6.333333
suits          24.000000
watches        26.666667
new watches    22.500000
dtype: float64

## 练习操作DataFrame

In [96]:
#import pandas as pd
import numpy as np
pd.set_option('precision', 1)

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

book_ratings = pd.DataFrame(dat)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [97]:
book_ratings.fillna(book_ratings.mean(), inplace = True)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [112]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]
best_rated

           Book Title           Author  User 1  User 2  User 3  User 4
0  Great Expectations  Charles Dickens     3.2     5.0     2.0     4.0
3    The Time Machine      H. G. Wells     2.9     3.8     4.0     5.0

In [108]:
best_rated['Book Title'].values

array(['Great Expectations', 'The Time Machine'], dtype=object)